Revit 2027 API
ParameterMap.Insert Method
Insert the specified item with the specified key into the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	string key,
	Parameter item
)
Public Overridable Function Insert (
	key As String,
	item As Parameter
) As Boolean
public:
virtual bool Insert(
	String^ key,
	Parameter^ item
)
abstract Insert :
        key : string *
        item : Parameter -> bool
override Insert :
        key : string *
        item : Parameter -> bool
Parameters
key String
The key to be used for inserting the item into the map.
item Parameter
The item to be inserted into the map.
Return Value
Boolean
Returns whether the item was inserted into the map.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace